The test failed with error
```
vcr_utils.go:152: Step 1/4 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_netapp_storage_pool.test_pool must be replaced
        -/+ resource "google_netapp_storage_pool" "test_pool" {
              ~ encryption_type       = "SERVICE_MANAGED" -> (known after apply)
              ~ id                    = "projects/<PROJECT_ID>/locations/us-central1/storagePools/tf-test-poolvr8zshpqn1" -> (known after apply)
                name                  = "tf-test-poolvr8zshpqn1"
              ~ network               = "projects/<PROJECT_NUMBER>/global/networks/tf-test-networkvr8zshpqn1" -> "projects/<PROJECT_ID>/global/networks/tf-test-networkvr8zshpqn1"
              + psa_range             = "tf-test-addressvr8zshpqn1" # forces replacement
              + volume_capacity_gib   = (known after apply)
              ~ volume_count          = 0 -> (known after apply)
                # (10 unchanged attributes hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
```

To be short, the issue is `+ psa_range             = "tf-test-addressvr8zshpqn1" # forces replacement`, which means that we explicitly specified `psa_range` field but the API did not return it back, and therefore it caused a perma-diff, in this case, a perma-destroy specifically, since it's immutable. We need to have the API fix for it probably.